---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyNotFitHostShape
source: html/56f002ea-0c42-835d-8289-9d54d348e4a2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyNotFitHostShape Property

The host shape has changed and the family is no longer appropriate.

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyNotFitHostShape { get; }
```